ninety_nine_Cats/app/controllers/cats_controller.rb

  def create
    kit = Cat.new(cat_params)
    if kit.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"