ninety_nine_Cats/app/models/cat_rental_request.rb

  def overlapping_requests
    cat_rentals = Cat.where(id: self.cat_id).includes(:rental_requests)
    cat_rentals = cat_rentals.first.rental_requests
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 ORDER BY "cats"."id" ASC LIMIT $2  [["id", 26], ["LIMIT", 1]]
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1  [["cat_id", 26]]